In [2]:
import pandas as pd

# Using the indices of the two data frames

In [3]:
df1 = pd.DataFrame(data = {'city_name' : [ 'Damascus', 'Daraa', 'Homs', 'Aleppo', 'Latakia'], 
                           'location' : ['South', 'South', 'Cneter', 'North', 'West']})
df2 = pd.DataFrame(data = {'city_name' : ['Damascus', 'Daraa'], 
                           'location' : ['South', 'South']})
df3 = pd.DataFrame(data = {'city_name' : ['Damascus', 'Daraa', 'As-Suwayda', 'Hama', 'Deir ez-Zor'], 
                            'location' : ['South', 'South', 'South', 'Center', 'East']})

In [4]:
df1

  city_name location
0  Damascus    South
1     Daraa    South
2      Homs   Cneter
3    Aleppo    North
4   Latakia     West

In [5]:
df2

  city_name location
0  Damascus    South
1     Daraa    South

In [6]:
df1[~df1.index.isin(df2.index)]

  city_name location
2      Homs   Cneter
3    Aleppo    North
4   Latakia     West

In [7]:
type(df2.index)

pandas.core.indexes.range.RangeIndex

In [8]:
df2.index

RangeIndex(start=0, stop=2, step=1)

In [9]:
type(df1.index.isin(df2.index))

numpy.ndarray

In [10]:
~df1.index.isin(df2.index)

array([False, False,  True,  True,  True])

In [11]:
df1.index.isin(df2.index)

array([ True,  True, False, False, False])

In [52]:
df1[[True, False, True, True, False]]

  city_name location
0  Damascus    South
2      Homs   Cneter
3    Aleppo    North

# Merging the two data frames

In [22]:
merge_df = df1.merge(df3, how='left', indicator=True)
merge_df

  city_name location     _merge
0  Damascus    South       both
1     Daraa    South       both
2      Homs   Cneter  left_only
3    Aleppo    North  left_only
4   Latakia     West  left_only

In [26]:
merge_df= merge_df[merge_df['_merge'] == 'left_only']
merge_df

  city_name location     _merge
2      Homs   Cneter  left_only
3    Aleppo    North  left_only
4   Latakia     West  left_only

In [58]:
merge_df = merge_df[['city_name', 'location']]
merge_df

  city_name location
2      Homs   Cneter
3    Aleppo    North
4   Latakia     West